app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."title" = 'Das Boot' ORDER BY release_date
SELECT "movies".* FROM "movies" ORDER BY releasie_date
---
  def index
    @sort_by = nil
    if params[:sortby] == "date" then @sortby = "release_date"; end
    if params[:sortby] == "title" then @sortby = "title"; end
    if @sortby != nil then
        @movies = Movie.find(:all, :order => @sortby)
    else
        @movies = Movie.all