app/controllers/movies_controller.rb

  def index
    @all_ratings = ['G','PG','PG-13','R']
    @selected_ratings = selected_ratings
    #@params = params

    @sort_by = nil
    if params[:sortby] == "date" then @sortby = "release_date"; end
    if params[:sortby] == "title" then @sortby = "title"; end
    @movies = Movie.find(:all, :conditions => {:rating => @selected_ratings}, :order => @sortby)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (NULL) ORDER BY release_date